  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-vms` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/ce547b2e-9426-455e-8114-523b57d00128/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.k8s-node[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "westus2"
    + max_bid_price                   = -1
    + name                            = "k8s-node-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "k8s"
    + size                            = "Standard_D4ads_v5"
    + virtual_machine_id              = (known after apply)
    + zone                            = "1"

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDMpJlkSij1jlS09G/cIuX648Jx6aQsNm0w4OOGuQHFIs7JXT9deh/Dnf669s4Qy3D6MxkYWpQ85c4fMYJR66cgtAUhueLMuMaz0jp/v/Y27BiqcH7JR8qeVkIvvhmBDGBze6GGkk7jcuR2v81Uf4qVb2YuM4HfrD/5Md1CJR3oMOlyhTbnzQhzgYreLMEozmePsQlTArP67gX/mGYOZdNI1M7hp6Vt3OTJctg4bmDjkhJgoNbOBQh58ixv8KKtxHIXgdfEBwyBlsPjOMneOFqMWycPh8g9T1NXiU5I0pfyKRhThiQCVDFG8a2kVDe2Ylyp0dhKbmZUechPXIU0QStGiByhhbEEBoWXIyDTLPRKK9JoGV/jo+kay0Y34y9CKiwMFa8KdeYRba+XBp0W+rsHGzolN5YSOxODSTimh7x45KCZw0r9tg29mLpSDac66hzzR9VlBP0ikAoAXcHUTrmKsdQRwRnNJohVilfXgJdsu23GWw2sRe4b4X0M6h43X5c4eld/2vjclC4PEvNv2Jlo2ZALNkZGpD+ujTbsWRJBCGkN3GWKLmPnkkSvJP+v0F32k6FrDUhEBEj7Jk4m2qAuLwhHSdZ7d302hJLHApM+vW4kUYT5psg/MGppK4KvJg63Gu81I/FCd+nnn426UnApzHxEYvtlAWjKTM9TOgOxoQ== jcetina@jasons-mbp.lan
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }
  }

# module.k8s-node[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "westus2"
    + mac_address                   = (known after apply)
    + name                          = "k8s-node-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "k8s"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + subnet_id                                          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/virtualNetworks/k8s-vnet/subnets/k8s-subnet"
      }
  }

Plan: 2 to add, 0 to change, 0 to destroy.
module.k8s-node[0].azurerm_network_interface.nic: Creating...
module.k8s-node[0].azurerm_network_interface.nic: Creation complete after 2s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkInterfaces/k8s-node-0-nic]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Creating...
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Creation complete after 49s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-node-0]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

  </details>